<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'failed' => 'Берилган маълумотлар бизнинг ёзувларимизга мос келмайди.',
    'throttle' => 'Кириш учун жуда кЎп уринишлар. Илтимос, :soniya сониядан кейин қайта уриниб кЎринг.',
    'wrong_password' => 'НотЎғри парол киритилган.',

    'auth_by_network' => 'Тармоқ орқали авторизатсия қилиш',
    'username' => 'Фойдаланувчи номи',
    'email_or_phone' => 'Электрон почта манзили ёки телефон рақами',
    'email_phone_or_username' => 'Электрон почта манзили, телефон рақами ёки фойдаланувчи номи',
    'email' => 'Электрон почта манзили',
    'phone' => 'Телефон рақами',
    'password' => 'Парол',
    'confirm_password' => 'Паролни тасдиқлаш',
    'sms_code' => 'СМС коди',
    'registration' => 'Рўйхатдан ўтиш',
    'register' => 'Рўйхатдан ўтмоқ',
    'login' => 'Тизимга кирмоқ',
    'phone_verification' => 'Телефон рақамини тасдиқлаш',
    'email_verification' => 'Электрон почта манзилини тасдиқлаш',
    'signup_confirmation' => 'Рўйхатдан ўтишни тасдиқлаш',
    'reset_password_confirmation' => 'Паролни тасдиқлашни тиклаш',
    'remember_me' => 'Эслаб қолмоқ',
    'resend' => 'Қайта юбормоқ',
    'forgot_password' => 'Паролингиз эсдан чиқдими?',
    'refer_link' => 'Илтимос, қуйидаги ҳаволага ўтинг:',
    'verify' => 'Тасдиқламоқ',
    'verify_email' => 'Электрон почтани тасдиқламоқ',
    'verify_your_email' => 'Электрон почта манзилингизни тасдиқланг',
    'verify_your_phone' => 'Телефон рақамингизни тасдиқланг',
    'reset_password_email' => 'Паролни электрон почта орқали тиклаш',
    'email_link_sent' => 'Электрон почта манзилингизга янги тасдиқлаш ҳаволаси юборилди.',
    'check_your_email' => 'Давом этишдан олдин электрон почтангизни текшириш ҳаволасини текширинг.',
    'if_email_link_not_received' => 'Агар сиз электрон почта хабарини олмаган бўлсангиз',
    'click_to_receive_another' => 'бошқасини сўраш учун шу ерни босинг',
    'reset_password' => 'Паролни тикламоқ',
    'send_reset_link_or_code' => 'Паролни тиклаш ҳаволасини ёки смс кодини юбормоқ',
    'reset' => 'Тикламоқ',
    'thanks' => 'Раҳмат',
    'add_phone' => 'Телефон рақамини қўшмоқ',
    'add_email' => 'Электрон почтани қўшмоқ',

    'email_verified_login' => 'Сизнинг электрон почтангиз тасдиқланди. Энди тизимга киришингиз мумкин.',
    'phone_verified_login' => 'Телефон рақамингиз тасдиқланган. Энди тизимга киришингиз мумкин.',
    'email_verified' => 'Сизнинг электрон почтангиз тасдиқланди.',
    'phone_verified' => 'Телефон рақамингиз тасдиқланган.',
    'password_successfully_reset' => 'Паролингиз муваффақиятли тикланди.',

    'invalid_params' => 'Параметрлар яроқсиз.',
    'email_not_identified' => 'Кечирасиз, электрон почтангизни аниқлаб бўлмади.',
    'phone_not_identified' => 'Кечирасиз, телефон рақамингизни аниқлаб бўлмади.',
    'link_not_found' => 'Кечирасиз, киритган ҳаволангизни аниқлаб бўлмади.',
    'email_not_found' => 'Электрон почта топилмади.',
    'phone_not_found' => 'Телефон рақами  топилмади.',
    'incorrect_verify_token' => 'Тасдиқлаш токени нотўғри.',
    'token_expired' => 'Токен муддати тугаган.',
    'need_to_confirm_email' => 'Аккаунтингизни тасдиқлашингиз керак. Илтимос, электрон почтангизни текширинг.',
    'missing_token' => 'Токен маълумотлари етишмаяпти.',
    'invalid_auth_token' => 'Яроқсиз аутентификатсия токени.',
    'account_not_verified' => 'Аккоунтингиз тасдиқланмаган.',
    'user_exists' => 'Ушбу фойдаланувчи номи, электрон почта манзили ёки телефони мавжуд.',
    'user_not_found' => 'Ушбу электрон почта ёки телефонга эга фойдаланувчи топилмади.',
    'email_not_verified' => 'Эмаилингиз тасдиқланмаган.',
    'phone_not_verified' => 'Телефон рақамингиз тасдиқланмаган.',
    'email_already_verified' => 'Эмаилингиз аллақачон тасдиқланган.',
    'phone_already_verified' => 'Телефон рақамингиз аллақачон тасдиқланган.',
    'email_already_added' => 'Электрон почта манзили аллақачон қўшилган.',
    'phone_already_added' => 'Телефон рақам аллақачон қўшилган.',

    'profile' => 'Профил',
    'favorites' => 'Севимлилар',
    'logout' => 'Тизимдан чиқмоқ',
];
