<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'failed' => 'Эти учетные данные не соответствуют нашим записям.',
    'throttle' => 'Слишком много попыток входа в систему. Повторите попытку через :seconds секунды.',
    'wrong_password' => 'Введен неправильный пароль.',

    'auth_by_network' => 'Авторизоваться по социальной сети',
    'username' => 'Имя пользователя',
    'email_or_phone' => 'Электронная почта или номер телефона',
    'email_phone_or_username' => 'Электронная почта, номер телефона или имя пользователя',
    'email' => 'Электронной почты',
    'phone' => 'Номер телефона',
    'password' => 'Пароль',
    'confirm_password' => 'Подтвердить пароль',
    'sms_code' => 'СМС код',
    'registration' => 'Регистрация',
    'register' => 'Регистрировать',
    'login' => 'Войти',
    'phone_verification' => 'Верификация номера телефона',
    'email_verification' => 'Верификация адреса электронной почты',
    'signup_confirmation' => 'Подтверждение регистрации',
    'reset_password_confirmation' => 'Подтверждение сброса пароля',
    'remember_me' => 'Запомнить',
    'resend' => 'Отправить',
    'forgot_password' => 'Забыли свой пароль?',
    'refer_link' => 'Пожалуйста, перейдите по следующей ссылке:',
    'verify' => 'Подтвердить',
    'verify_email' => 'Подтвердить электронную почту',
    'verify_your_email' => 'Подтвердите свою электронную почту',
    'verify_your_phone' => 'Подтвердите свой номер телефона',
    'reset_password_email' => 'Сбросить пароль через адрес электронной почты',
    'email_link_sent' => 'На ваш адрес электронной почты была отправлена новая ссылка для подтверждения.',
    'check_your_email' => 'Прежде чем продолжить, проверьте свою электронную почту на наличие ссылки для подтверждения.',
    'if_email_link_not_received' => 'Если вы не получили письмо',
    'click_to_receive_another' => 'нажмите здесь, чтобы запросить другой',
    'reset_password' => 'Сброс пароля',
    'send_reset_link_or_code' => 'Отправить ссылку или смс код для сброса пароля',
    'reset' => 'Сбросить',
    'thanks' => 'Спасибо',
    'add_phone' => 'Добавить номер телефона',
    'add_email' => 'Добавить электронную почту',

    'email_verified_login' => 'Ваш адрес электронной почты подтвержден. Теперь вы можете войти в систему.',
    'phone_verified_login' => 'Ваш номер телефона подтвержден. Теперь вы можете войти в систему.',
    'email_verified' => 'Ваш адрес электронной почты подтвержден.',
    'phone_verified' => 'Ваш номер телефона подтвержден.',
    'password_successfully_reset' => 'Ваш пароль успешно сброшен.',

    'invalid_params' => 'Неверные параметры.',
    'email_not_identified' => 'Извините, ваш адрес электронной почты не идентифицирован.',
    'phone_not_identified' => 'К сожалению, ваш номер телефона не может быть идентифицирован.',
    'link_not_found' => 'Извините, ваша ссылка не может быть идентифицирована.',
    'email_not_found' => 'Электронная почта не найдена.',
    'phone_not_found' => 'Номер телефона не найден.',
    'incorrect_verify_token' => 'Неверный токен подтверждения.',
    'token_expired' => 'Срок действия токена истек.',
    'need_to_confirm_email' => 'Вам необходимо подтвердить свою учетную запись. Пожалуйста, проверьте свою электронную почту.',
    'missing_token' => 'Отсутствует информация о токене.',
    'invalid_auth_token' => 'Недействительный токен аутентификации.',
    'account_not_verified' => 'Ваша учетная запись не подтверждена.',
    'user_exists' => 'Пользователь с этим именем пользователя, адресом электронной почты или телефоном существует.',
    'user_not_found' => 'Пользователь с этим адресом электронной почты или телефоном не найден.',
    'email_not_verified' => 'Ваш адрес электронной почты не подтвержден.',
    'phone_not_verified' => 'Ваш номер телефона не подтвержден.',
    'email_already_verified' => 'Ваш адрес электронной почты уже подтвержден.',
    'phone_already_verified' => 'Ваш номер телефона уже подтвержден.',
    'email_already_added' => 'Электронный адрес уже добавлен.',
    'phone_already_added' => 'Номер телефона уже добавлен.',

    'profile' => 'Профиль',
    'favorites' => 'Избранное',
    'logout' => 'Выйти',
];
